Incipiens/ESP32-Uptime-Monitoring/src/main.cpp
  Serial.printf("MeshCore TX: cmd 0x%02X, payload length %d\n", payload[0], (int)payloadLen);
  
  bool success = false;
  try {
    // Reset response state before sending
    meshResponseReceived = false;
    meshLastResponseCode = 0xFF;
    
    meshTxCharacteristic->writeValue(frame, frameLen, false);
    success = true;
  } catch (...) {
    Serial.println("MeshCore TX failed: write error");
  }
  
  // Only delete if we used heap allocation
  if (frame != stackBuffer) {
    delete[] frame;
  }
  
  return success;
}

// Wait for a response from the MeshCore device
bool waitForMeshResponse(unsigned long timeoutMs = 5000) {
  unsigned long start = millis();
  while (!meshResponseReceived && (millis() - start) < timeoutMs) {
    delay(10);
  }
  return meshResponseReceived;
}

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HOME_ASSISTANT,
  TYPE_JELLYFIN,
  TYPE_HTTP_GET,
  TYPE_PING
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  bool isUp;
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// prototype declarations
void initWiFi();
void initWebServer();
void initFileSystem();
bool ensureAuthenticated(AsyncWebServerRequest* request);
void loadServices();
void saveServices();
String generateServiceId();
void checkServices();
void sendOfflineNotification(const Service& service);
void sendOnlineNotification(const Service& service);
void sendSmtpNotification(const String& title, const String& message);
bool checkHomeAssistant(Service& service);
bool checkJellyfin(Service& service);
bool checkHttpGet(Service& service);
bool checkPing(Service& service);
String getWebPage();
String getServiceTypeString(ServiceType type);
String base64Encode(const String& input);
bool readSmtpResponse(WiFiClient& client, int expectedCode);
bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode);

void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("Starting ESP32 Uptime Monitor...");

  // Initialize filesystem
  initFileSystem();

  // Scan for BLE devices at boot and log them to serial monitor
  // This runs before WiFi to avoid ESP32-S3 WiFi/BLE coexistence issues
  scanBLEDevices();

  // Initialize WiFi (BLE is deinitialized after scan to allow this)
  initWiFi();

  // Load saved services
  loadServices();

  // Initialize web server
  initWebServer();

  Serial.println("System ready!");
  Serial.print("Access web interface at: http://");
  Serial.println(WiFi.localIP());
}

void loop() {
  static unsigned long lastCheckTime = 0;
  unsigned long currentTime = millis();

  // Skip service checks if monitoring is paused (e.g., during BLE operations)
  if (monitoringPaused) {
    delay(10);
    return;
  }

  // Check services every 5 seconds
  if (currentTime - lastCheckTime >= 5000) {
    checkServices();
    lastCheckTime = currentTime;
  }

  delay(10);
}

void initWiFi() {
  Serial.println("Connecting to WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to connect to WiFi!");
  }
}

void initBLE() {
  Serial.println("Initializing BLE MeshCore client...");
  Serial.printf("Free heap before BLE init: %d bytes\n", ESP.getFreeHeap());
  
  BLEDevice::init(BLE_DEVICE_NAME);
  
  // Verify initialization succeeded before continuing
  if (!BLEDevice::getInitialized()) {
    Serial.println("ERROR: BLE initialization failed - check if Bluetooth is enabled in sdkconfig");
    Serial.println("Common causes: insufficient memory, Bluetooth disabled in build configuration, or hardware issue");
    Serial.printf("Free heap after failed init: %d bytes\n", ESP.getFreeHeap());
    return;
  }
  bleInitialized = true;
  Serial.printf("BLE initialized successfully as '%s'\n", BLE_DEVICE_NAME);
  Serial.printf("Free heap after BLE init: %d bytes\n", ESP.getFreeHeap());

  // Set up PIN-based pairing to satisfy MeshCore's security expectations
  BLESecurity* security = new BLESecurity();
  security->setAuthenticationMode(ESP_LE_AUTH_REQ_SC_MITM_BOND);
  security->setCapability(ESP_IO_CAP_OUT);
  security->setInitEncryptionKey(ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK);
  security->setStaticPIN(BLE_PAIRING_PIN);

  connectToMeshCore();
}

void scanBLEDevices() {
  Serial.println("========================================");
  Serial.println("Starting BLE device scan...");
  Serial.println("========================================");
  
  // Log available heap before BLE initialization for debugging memory issues
  Serial.printf("Free heap before BLE init: %d bytes\n", ESP.getFreeHeap());
  
  // Initialize BLE for scanning
  BLEDevice::init(BLE_DEVICE_NAME);
  
  if (!BLEDevice::getInitialized()) {
    Serial.println("ERROR: BLE initialization failed, cannot scan for devices");
    Serial.println("Possible causes:");
    Serial.println("  - Bluetooth disabled in build configuration (CONFIG_BT_ENABLED)");
    Serial.println("  - Insufficient heap memory for BLE stack");
    Serial.println("  - Hardware issue with the ESP32 Bluetooth radio");
    Serial.printf("Free heap after failed init: %d bytes\n", ESP.getFreeHeap());
    return;
  }
  
  Serial.printf("BLE initialized successfully as '%s'\n", BLE_DEVICE_NAME);
  Serial.printf("Free heap after BLE init: %d bytes\n", ESP.getFreeHeap());
  
