Incipiens/ESP32-Uptime-Monitoring/src/main.cpp
    // Register for notifications
    rxChar->registerForNotify(meshNotifyCallback);
    
    meshTxCharacteristic = txChar;
    meshRxCharacteristic = rxChar;
    meshDeviceConnected = true;
    meshProtocolState = MESH_STATE_CONNECTED;
    lastMeshError = "";
    Serial.println("Connected to MeshCore peer via Nordic UART Service");

    // Perform MeshCore protocol handshake
    if (!ensureMeshChannel()) {
      Serial.println("ensureMeshChannel() failed, disconnecting...");
      meshClient->disconnect();
      meshDeviceConnected = false;
      meshProtocolState = MESH_STATE_DISCONNECTED;
      return false;
    }

    return true;
  }

  // Free scan results so the BLE stack can reuse memory on the next attempt
  scan->clearResults();

  lastMeshError = "MeshCore peer not found during scan";
  Serial.println(lastMeshError.c_str());
  return false;
}
void disconnectFromMeshCore() {
  // Clean up the BLE client properly before deinit
  if (meshClient != nullptr) {
    if (meshClient->isConnected()) {
      Serial.println("Disconnecting from MeshCore...");
      meshClient->disconnect();
    }
    // Delete the client to properly deregister it from BLE stack
    delete meshClient;
    meshClient = nullptr;
  }
  
  meshDeviceConnected = false;
  meshTxCharacteristic = nullptr;
  meshRxCharacteristic = nullptr;
  meshChannelReady = false;
  meshProtocolState = MESH_STATE_DISCONNECTED;
  meshRxBufferPos = 0;
  
  // Only deinitialize BLE if it was initialized
  if (bleInitialized) {
    delay(BLE_DEINIT_CLEANUP_DELAY_MS);
    BLEDevice::deinit();
    bleInitialized = false;
    Serial.println("BLE deinitialized");
  }
}

void disconnectWiFi() {
  Serial.println("Disconnecting WiFi for BLE operation...");
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(100); // Allow WiFi to fully shut down
  Serial.println("WiFi disconnected");
}

void reconnectWiFi() {
  Serial.println("Reconnecting WiFi after BLE operation...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi reconnected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to reconnect to WiFi!");
  }
}

bool ensureMeshChannel() {
  if (meshChannelReady && meshProtocolState == MESH_STATE_READY) {
    return true;
  }

  if (!meshDeviceConnected || meshTxCharacteristic == nullptr) {
    return false;
  }

  // Step 1: Send CMD_DEVICE_QUERY to negotiate protocol version
  if (meshProtocolState < MESH_STATE_NEGOTIATED) {
    Serial.println("Sending CMD_DEVICE_QUERY...");
    uint8_t queryCmd[2] = { CMD_DEVICE_QUERY, meshProtocolVersion };
    if (!sendMeshFrame(queryCmd, sizeof(queryCmd))) {
      lastMeshError = "Failed to send CMD_DEVICE_QUERY";
      return false;
    }
    
    if (!waitForMeshResponse(5000)) {
      lastMeshError = "Timeout waiting for RESP_CODE_DEVICE_INFO";
      return false;
    }
    
    if (meshLastResponseCode != RESP_CODE_DEVICE_INFO) {
      lastMeshError = "Unexpected response to CMD_DEVICE_QUERY";
      Serial.printf("Expected RESP_CODE_DEVICE_INFO (0x%02X), got 0x%02X\n", RESP_CODE_DEVICE_INFO, meshLastResponseCode);
      return false;
    }
    
    meshProtocolState = MESH_STATE_NEGOTIATED;
    Serial.println("Protocol negotiated successfully");
  }

  // Step 2: Send CMD_APP_START to start the application session
  if (meshProtocolState < MESH_STATE_READY) {
    Serial.println("Sending CMD_APP_START...");
    // CMD_APP_START payload: version (1), reserved (6), app_name (variable)
    const char* appName = "ESP32-Uptime";
    size_t appNameLen = strlen(appName);
    size_t cmdLen = 1 + 1 + 6 + appNameLen;
    uint8_t* startCmd = new uint8_t[cmdLen];
    startCmd[0] = CMD_APP_START;
    startCmd[1] = meshProtocolVersion;  // version
    memset(startCmd + 2, 0, 6);  // reserved bytes
    memcpy(startCmd + 8, appName, appNameLen);
    
    bool sent = sendMeshFrame(startCmd, cmdLen);
    delete[] startCmd;
    
    if (!sent) {
      lastMeshError = "Failed to send CMD_APP_START";
      return false;
    }
    
    if (!waitForMeshResponse(5000)) {
      lastMeshError = "Timeout waiting for RESP_CODE_SELF_INFO";
      return false;
    }
    
    if (meshLastResponseCode != RESP_CODE_SELF_INFO) {
      lastMeshError = "Unexpected response to CMD_APP_START";
      Serial.printf("Expected RESP_CODE_SELF_INFO (0x%02X), got 0x%02X\n", RESP_CODE_SELF_INFO, meshLastResponseCode);
      return false;
    }
    
    meshProtocolState = MESH_STATE_READY;
    Serial.println("Application session started successfully");
  }

  // Step 3: Provision the channel if needed
  if (!provisionMeshChannel()) {
    lastMeshError = "Mesh channel provisioning failed";
    return false;
  }

  meshChannelReady = true;
  return true;
}

bool provisionMeshChannel() {
  if (strlen(BLE_MESH_CHANNEL_NAME) == 0) {
    lastMeshError = "Mesh channel name missing";
    return false;
  }

  Serial.printf("Checking/provisioning MeshCore channel '%s'...\n", BLE_MESH_CHANNEL_NAME);
  
  // First try to get the channel at index 0 to see if it exists
  uint8_t getChannelCmd[2] = { CMD_GET_CHANNEL, meshChannelIndex };
  if (!sendMeshFrame(getChannelCmd, sizeof(getChannelCmd))) {
    lastMeshError = "Failed to send CMD_GET_CHANNEL";
    return false;
  }
  
  if (!waitForMeshResponse(3000)) {
    Serial.println("No response to CMD_GET_CHANNEL, will try to set channel");
  } else if (meshLastResponseCode == RESP_CODE_CHANNEL_INFO) {
    // Channel exists, we can use it
    Serial.println("Channel already exists, ready to use");
    return true;
  }
  
  // Channel doesn't exist or error, try to create/set it
  // CMD_SET_CHANNEL payload: channel_index (1), name (32 bytes null-padded), key (16 bytes)
  Serial.printf("Setting channel at index %d...\n", meshChannelIndex);
  
  uint8_t setChannelCmd[1 + 1 + 32 + 16];
  memset(setChannelCmd, 0, sizeof(setChannelCmd));
  setChannelCmd[0] = CMD_SET_CHANNEL;
  setChannelCmd[1] = meshChannelIndex;
  
